RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL34Z4/include/MKL34Z4_extension.h
/*! @brief Set the BPBLCD48 field to a new value. */
#define LCD_WR_WF8B_BPBLCD48(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD48_MASK, LCD_WF8B_BPBLCD48(value)))
#define LCD_BWR_WF8B_BPBLCD48(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD48_SHIFT), LCD_WF8B_BPBLCD48_SHIFT, LCD_WF8B_BPBLCD48_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD10[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD10 field. */
#define LCD_RD_WF8B_BPBLCD10(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD10_MASK) >> LCD_WF8B_BPBLCD10_SHIFT)
#define LCD_BRD_WF8B_BPBLCD10(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD10_SHIFT, LCD_WF8B_BPBLCD10_WIDTH))

/*! @brief Set the BPBLCD10 field to a new value. */
#define LCD_WR_WF8B_BPBLCD10(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD10_MASK, LCD_WF8B_BPBLCD10(value)))
#define LCD_BWR_WF8B_BPBLCD10(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD10_SHIFT), LCD_WF8B_BPBLCD10_SHIFT, LCD_WF8B_BPBLCD10_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD15[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD15 field. */
#define LCD_RD_WF8B_BPBLCD15(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD15_MASK) >> LCD_WF8B_BPBLCD15_SHIFT)
#define LCD_BRD_WF8B_BPBLCD15(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD15_SHIFT, LCD_WF8B_BPBLCD15_WIDTH))

/*! @brief Set the BPBLCD15 field to a new value. */
#define LCD_WR_WF8B_BPBLCD15(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD15_MASK, LCD_WF8B_BPBLCD15(value)))
#define LCD_BWR_WF8B_BPBLCD15(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD15_SHIFT), LCD_WF8B_BPBLCD15_SHIFT, LCD_WF8B_BPBLCD15_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD36[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD36 field. */
#define LCD_RD_WF8B_BPBLCD36(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD36_MASK) >> LCD_WF8B_BPBLCD36_SHIFT)
#define LCD_BRD_WF8B_BPBLCD36(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD36_SHIFT, LCD_WF8B_BPBLCD36_WIDTH))

/*! @brief Set the BPBLCD36 field to a new value. */
#define LCD_WR_WF8B_BPBLCD36(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD36_MASK, LCD_WF8B_BPBLCD36(value)))
#define LCD_BWR_WF8B_BPBLCD36(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD36_SHIFT), LCD_WF8B_BPBLCD36_SHIFT, LCD_WF8B_BPBLCD36_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD44[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD44 field. */
#define LCD_RD_WF8B_BPBLCD44(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD44_MASK) >> LCD_WF8B_BPBLCD44_SHIFT)
#define LCD_BRD_WF8B_BPBLCD44(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD44_SHIFT, LCD_WF8B_BPBLCD44_WIDTH))

/*! @brief Set the BPBLCD44 field to a new value. */
#define LCD_WR_WF8B_BPBLCD44(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD44_MASK, LCD_WF8B_BPBLCD44(value)))
#define LCD_BWR_WF8B_BPBLCD44(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD44_SHIFT), LCD_WF8B_BPBLCD44_SHIFT, LCD_WF8B_BPBLCD44_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD62[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD62 field. */
#define LCD_RD_WF8B_BPBLCD62(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD62_MASK) >> LCD_WF8B_BPBLCD62_SHIFT)
#define LCD_BRD_WF8B_BPBLCD62(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD62_SHIFT, LCD_WF8B_BPBLCD62_WIDTH))

/*! @brief Set the BPBLCD62 field to a new value. */
#define LCD_WR_WF8B_BPBLCD62(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD62_MASK, LCD_WF8B_BPBLCD62(value)))
#define LCD_BWR_WF8B_BPBLCD62(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD62_SHIFT), LCD_WF8B_BPBLCD62_SHIFT, LCD_WF8B_BPBLCD62_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD53[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD53 field. */
#define LCD_RD_WF8B_BPBLCD53(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD53_MASK) >> LCD_WF8B_BPBLCD53_SHIFT)
#define LCD_BRD_WF8B_BPBLCD53(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD53_SHIFT, LCD_WF8B_BPBLCD53_WIDTH))

/*! @brief Set the BPBLCD53 field to a new value. */
#define LCD_WR_WF8B_BPBLCD53(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD53_MASK, LCD_WF8B_BPBLCD53(value)))
#define LCD_BWR_WF8B_BPBLCD53(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD53_SHIFT), LCD_WF8B_BPBLCD53_SHIFT, LCD_WF8B_BPBLCD53_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD22[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD22 field. */
#define LCD_RD_WF8B_BPBLCD22(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD22_MASK) >> LCD_WF8B_BPBLCD22_SHIFT)
#define LCD_BRD_WF8B_BPBLCD22(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD22_SHIFT, LCD_WF8B_BPBLCD22_WIDTH))

