RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL34Z4/include/MKL34Z4_extension.h
/*! @brief Set the BPBLCD22 field to a new value. */
#define LCD_WR_WF8B_BPBLCD22(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD22_MASK, LCD_WF8B_BPBLCD22(value)))
#define LCD_BWR_WF8B_BPBLCD22(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD22_SHIFT), LCD_WF8B_BPBLCD22_SHIFT, LCD_WF8B_BPBLCD22_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD47[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD47 field. */
#define LCD_RD_WF8B_BPBLCD47(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD47_MASK) >> LCD_WF8B_BPBLCD47_SHIFT)
#define LCD_BRD_WF8B_BPBLCD47(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD47_SHIFT, LCD_WF8B_BPBLCD47_WIDTH))

/*! @brief Set the BPBLCD47 field to a new value. */
#define LCD_WR_WF8B_BPBLCD47(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD47_MASK, LCD_WF8B_BPBLCD47(value)))
#define LCD_BWR_WF8B_BPBLCD47(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD47_SHIFT), LCD_WF8B_BPBLCD47_SHIFT, LCD_WF8B_BPBLCD47_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD33[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD33 field. */
#define LCD_RD_WF8B_BPBLCD33(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD33_MASK) >> LCD_WF8B_BPBLCD33_SHIFT)
#define LCD_BRD_WF8B_BPBLCD33(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD33_SHIFT, LCD_WF8B_BPBLCD33_WIDTH))

/*! @brief Set the BPBLCD33 field to a new value. */
#define LCD_WR_WF8B_BPBLCD33(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD33_MASK, LCD_WF8B_BPBLCD33(value)))
#define LCD_BWR_WF8B_BPBLCD33(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD33_SHIFT), LCD_WF8B_BPBLCD33_SHIFT, LCD_WF8B_BPBLCD33_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD2[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD2 field. */
#define LCD_RD_WF8B_BPBLCD2(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD2_MASK) >> LCD_WF8B_BPBLCD2_SHIFT)
#define LCD_BRD_WF8B_BPBLCD2(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD2_SHIFT, LCD_WF8B_BPBLCD2_WIDTH))

/*! @brief Set the BPBLCD2 field to a new value. */
#define LCD_WR_WF8B_BPBLCD2(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD2_MASK, LCD_WF8B_BPBLCD2(value)))
#define LCD_BWR_WF8B_BPBLCD2(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD2_SHIFT), LCD_WF8B_BPBLCD2_SHIFT, LCD_WF8B_BPBLCD2_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD49[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD49 field. */
#define LCD_RD_WF8B_BPBLCD49(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD49_MASK) >> LCD_WF8B_BPBLCD49_SHIFT)
#define LCD_BRD_WF8B_BPBLCD49(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD49_SHIFT, LCD_WF8B_BPBLCD49_WIDTH))

/*! @brief Set the BPBLCD49 field to a new value. */
#define LCD_WR_WF8B_BPBLCD49(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD49_MASK, LCD_WF8B_BPBLCD49(value)))
#define LCD_BWR_WF8B_BPBLCD49(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD49_SHIFT), LCD_WF8B_BPBLCD49_SHIFT, LCD_WF8B_BPBLCD49_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD0[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD0 field. */
#define LCD_RD_WF8B_BPBLCD0(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD0_MASK) >> LCD_WF8B_BPBLCD0_SHIFT)
#define LCD_BRD_WF8B_BPBLCD0(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD0_SHIFT, LCD_WF8B_BPBLCD0_WIDTH))

/*! @brief Set the BPBLCD0 field to a new value. */
#define LCD_WR_WF8B_BPBLCD0(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD0_MASK, LCD_WF8B_BPBLCD0(value)))
#define LCD_BWR_WF8B_BPBLCD0(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD0_SHIFT), LCD_WF8B_BPBLCD0_SHIFT, LCD_WF8B_BPBLCD0_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD55[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD55 field. */
#define LCD_RD_WF8B_BPBLCD55(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD55_MASK) >> LCD_WF8B_BPBLCD55_SHIFT)
#define LCD_BRD_WF8B_BPBLCD55(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD55_SHIFT, LCD_WF8B_BPBLCD55_WIDTH))

/*! @brief Set the BPBLCD55 field to a new value. */
#define LCD_WR_WF8B_BPBLCD55(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD55_MASK, LCD_WF8B_BPBLCD55(value)))
#define LCD_BWR_WF8B_BPBLCD55(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD55_SHIFT), LCD_WF8B_BPBLCD55_SHIFT, LCD_WF8B_BPBLCD55_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD56[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD56 field. */
#define LCD_RD_WF8B_BPBLCD56(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD56_MASK) >> LCD_WF8B_BPBLCD56_SHIFT)
#define LCD_BRD_WF8B_BPBLCD56(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD56_SHIFT, LCD_WF8B_BPBLCD56_WIDTH))

