RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL34Z4/include/MKL34Z4_extension.h
/*! @brief Set the BPBLCD3 field to a new value. */
#define LCD_WR_WF8B_BPBLCD3(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD3_MASK, LCD_WF8B_BPBLCD3(value)))
#define LCD_BWR_WF8B_BPBLCD3(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD3_SHIFT), LCD_WF8B_BPBLCD3_SHIFT, LCD_WF8B_BPBLCD3_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD16[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD16 field. */
#define LCD_RD_WF8B_BPBLCD16(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD16_MASK) >> LCD_WF8B_BPBLCD16_SHIFT)
#define LCD_BRD_WF8B_BPBLCD16(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD16_SHIFT, LCD_WF8B_BPBLCD16_WIDTH))

/*! @brief Set the BPBLCD16 field to a new value. */
#define LCD_WR_WF8B_BPBLCD16(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD16_MASK, LCD_WF8B_BPBLCD16(value)))
#define LCD_BWR_WF8B_BPBLCD16(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD16_SHIFT), LCD_WF8B_BPBLCD16_SHIFT, LCD_WF8B_BPBLCD16_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD13[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD13 field. */
#define LCD_RD_WF8B_BPBLCD13(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD13_MASK) >> LCD_WF8B_BPBLCD13_SHIFT)
#define LCD_BRD_WF8B_BPBLCD13(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD13_SHIFT, LCD_WF8B_BPBLCD13_WIDTH))

/*! @brief Set the BPBLCD13 field to a new value. */
#define LCD_WR_WF8B_BPBLCD13(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD13_MASK, LCD_WF8B_BPBLCD13(value)))
#define LCD_BWR_WF8B_BPBLCD13(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPBLCD13_SHIFT), LCD_WF8B_BPBLCD13_SHIFT, LCD_WF8B_BPBLCD13_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD10[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD10 field. */
#define LCD_RD_WF8B_BPCLCD10(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD10_MASK) >> LCD_WF8B_BPCLCD10_SHIFT)
#define LCD_BRD_WF8B_BPCLCD10(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD10_SHIFT, LCD_WF8B_BPCLCD10_WIDTH))

/*! @brief Set the BPCLCD10 field to a new value. */
#define LCD_WR_WF8B_BPCLCD10(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD10_MASK, LCD_WF8B_BPCLCD10(value)))
#define LCD_BWR_WF8B_BPCLCD10(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD10_SHIFT), LCD_WF8B_BPCLCD10_SHIFT, LCD_WF8B_BPCLCD10_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD55[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD55 field. */
#define LCD_RD_WF8B_BPCLCD55(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD55_MASK) >> LCD_WF8B_BPCLCD55_SHIFT)
#define LCD_BRD_WF8B_BPCLCD55(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD55_SHIFT, LCD_WF8B_BPCLCD55_WIDTH))

/*! @brief Set the BPCLCD55 field to a new value. */
#define LCD_WR_WF8B_BPCLCD55(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD55_MASK, LCD_WF8B_BPCLCD55(value)))
#define LCD_BWR_WF8B_BPCLCD55(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD55_SHIFT), LCD_WF8B_BPCLCD55_SHIFT, LCD_WF8B_BPCLCD55_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD2[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD2 field. */
#define LCD_RD_WF8B_BPCLCD2(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD2_MASK) >> LCD_WF8B_BPCLCD2_SHIFT)
#define LCD_BRD_WF8B_BPCLCD2(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD2_SHIFT, LCD_WF8B_BPCLCD2_WIDTH))

/*! @brief Set the BPCLCD2 field to a new value. */
#define LCD_WR_WF8B_BPCLCD2(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD2_MASK, LCD_WF8B_BPCLCD2(value)))
#define LCD_BWR_WF8B_BPCLCD2(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD2_SHIFT), LCD_WF8B_BPCLCD2_SHIFT, LCD_WF8B_BPCLCD2_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD23[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD23 field. */
#define LCD_RD_WF8B_BPCLCD23(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD23_MASK) >> LCD_WF8B_BPCLCD23_SHIFT)
#define LCD_BRD_WF8B_BPCLCD23(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD23_SHIFT, LCD_WF8B_BPCLCD23_WIDTH))

/*! @brief Set the BPCLCD23 field to a new value. */
#define LCD_WR_WF8B_BPCLCD23(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD23_MASK, LCD_WF8B_BPCLCD23(value)))
#define LCD_BWR_WF8B_BPCLCD23(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD23_SHIFT), LCD_WF8B_BPCLCD23_SHIFT, LCD_WF8B_BPCLCD23_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD48[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD48 field. */
#define LCD_RD_WF8B_BPCLCD48(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD48_MASK) >> LCD_WF8B_BPCLCD48_SHIFT)
#define LCD_BRD_WF8B_BPCLCD48(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD48_SHIFT, LCD_WF8B_BPCLCD48_WIDTH))

/*! @brief Set the BPCLCD48 field to a new value. */
#define LCD_WR_WF8B_BPCLCD48(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPCLCD48_MASK, LCD_WF8B_BPCLCD48(value)))
#define LCD_BWR_WF8B_BPCLCD48(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPCLCD48_SHIFT), LCD_WF8B_BPCLCD48_SHIFT, LCD_WF8B_BPCLCD48_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPCLCD24[2] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase C
 * - 0b1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPCLCD24 field. */
#define LCD_RD_WF8B_BPCLCD24(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPCLCD24_MASK) >> LCD_WF8B_BPCLCD24_SHIFT)
#define LCD_BRD_WF8B_BPCLCD24(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPCLCD24_SHIFT, LCD_WF8B_BPCLCD24_WIDTH))

