RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL34Z4/include/MKL34Z4_extension.h
/*! @brief Set the BPDLCD59 field to a new value. */
#define LCD_WR_WF8B_BPDLCD59(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD59_MASK, LCD_WF8B_BPDLCD59(value)))
#define LCD_BWR_WF8B_BPDLCD59(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD59_SHIFT), LCD_WF8B_BPDLCD59_SHIFT, LCD_WF8B_BPDLCD59_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD5[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD5 field. */
#define LCD_RD_WF8B_BPDLCD5(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD5_MASK) >> LCD_WF8B_BPDLCD5_SHIFT)
#define LCD_BRD_WF8B_BPDLCD5(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD5_SHIFT, LCD_WF8B_BPDLCD5_WIDTH))

/*! @brief Set the BPDLCD5 field to a new value. */
#define LCD_WR_WF8B_BPDLCD5(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD5_MASK, LCD_WF8B_BPDLCD5(value)))
#define LCD_BWR_WF8B_BPDLCD5(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD5_SHIFT), LCD_WF8B_BPDLCD5_SHIFT, LCD_WF8B_BPDLCD5_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD19[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD19 field. */
#define LCD_RD_WF8B_BPDLCD19(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD19_MASK) >> LCD_WF8B_BPDLCD19_SHIFT)
#define LCD_BRD_WF8B_BPDLCD19(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD19_SHIFT, LCD_WF8B_BPDLCD19_WIDTH))

/*! @brief Set the BPDLCD19 field to a new value. */
#define LCD_WR_WF8B_BPDLCD19(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD19_MASK, LCD_WF8B_BPDLCD19(value)))
#define LCD_BWR_WF8B_BPDLCD19(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD19_SHIFT), LCD_WF8B_BPDLCD19_SHIFT, LCD_WF8B_BPDLCD19_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD6[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD6 field. */
#define LCD_RD_WF8B_BPDLCD6(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD6_MASK) >> LCD_WF8B_BPDLCD6_SHIFT)
#define LCD_BRD_WF8B_BPDLCD6(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD6_SHIFT, LCD_WF8B_BPDLCD6_WIDTH))

/*! @brief Set the BPDLCD6 field to a new value. */
#define LCD_WR_WF8B_BPDLCD6(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD6_MASK, LCD_WF8B_BPDLCD6(value)))
#define LCD_BWR_WF8B_BPDLCD6(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD6_SHIFT), LCD_WF8B_BPDLCD6_SHIFT, LCD_WF8B_BPDLCD6_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD26[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD26 field. */
#define LCD_RD_WF8B_BPDLCD26(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD26_MASK) >> LCD_WF8B_BPDLCD26_SHIFT)
#define LCD_BRD_WF8B_BPDLCD26(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD26_SHIFT, LCD_WF8B_BPDLCD26_WIDTH))

/*! @brief Set the BPDLCD26 field to a new value. */
#define LCD_WR_WF8B_BPDLCD26(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD26_MASK, LCD_WF8B_BPDLCD26(value)))
#define LCD_BWR_WF8B_BPDLCD26(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD26_SHIFT), LCD_WF8B_BPDLCD26_SHIFT, LCD_WF8B_BPDLCD26_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD0[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD0 field. */
#define LCD_RD_WF8B_BPDLCD0(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD0_MASK) >> LCD_WF8B_BPDLCD0_SHIFT)
#define LCD_BRD_WF8B_BPDLCD0(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD0_SHIFT, LCD_WF8B_BPDLCD0_WIDTH))

/*! @brief Set the BPDLCD0 field to a new value. */
#define LCD_WR_WF8B_BPDLCD0(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD0_MASK, LCD_WF8B_BPDLCD0(value)))
#define LCD_BWR_WF8B_BPDLCD0(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD0_SHIFT), LCD_WF8B_BPDLCD0_SHIFT, LCD_WF8B_BPDLCD0_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD50[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD50 field. */
#define LCD_RD_WF8B_BPDLCD50(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD50_MASK) >> LCD_WF8B_BPDLCD50_SHIFT)
#define LCD_BRD_WF8B_BPDLCD50(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD50_SHIFT, LCD_WF8B_BPDLCD50_WIDTH))

/*! @brief Set the BPDLCD50 field to a new value. */
#define LCD_WR_WF8B_BPDLCD50(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD50_MASK, LCD_WF8B_BPDLCD50(value)))
#define LCD_BWR_WF8B_BPDLCD50(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD50_SHIFT), LCD_WF8B_BPDLCD50_SHIFT, LCD_WF8B_BPDLCD50_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD46[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD46 field. */
#define LCD_RD_WF8B_BPDLCD46(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD46_MASK) >> LCD_WF8B_BPDLCD46_SHIFT)
#define LCD_BRD_WF8B_BPDLCD46(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD46_SHIFT, LCD_WF8B_BPDLCD46_WIDTH))

/*! @brief Set the BPDLCD46 field to a new value. */
#define LCD_WR_WF8B_BPDLCD46(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD46_MASK, LCD_WF8B_BPDLCD46(value)))
#define LCD_BWR_WF8B_BPDLCD46(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD46_SHIFT), LCD_WF8B_BPDLCD46_SHIFT, LCD_WF8B_BPDLCD46_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD18[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD18 field. */
#define LCD_RD_WF8B_BPDLCD18(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD18_MASK) >> LCD_WF8B_BPDLCD18_SHIFT)
#define LCD_BRD_WF8B_BPDLCD18(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD18_SHIFT, LCD_WF8B_BPDLCD18_WIDTH))

/*! @brief Set the BPDLCD18 field to a new value. */
#define LCD_WR_WF8B_BPDLCD18(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD18_MASK, LCD_WF8B_BPDLCD18(value)))
#define LCD_BWR_WF8B_BPDLCD18(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD18_SHIFT), LCD_WF8B_BPDLCD18_SHIFT, LCD_WF8B_BPDLCD18_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD61[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD61 field. */
#define LCD_RD_WF8B_BPDLCD61(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD61_MASK) >> LCD_WF8B_BPDLCD61_SHIFT)
#define LCD_BRD_WF8B_BPDLCD61(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD61_SHIFT, LCD_WF8B_BPDLCD61_WIDTH))

/*! @brief Set the BPDLCD61 field to a new value. */
#define LCD_WR_WF8B_BPDLCD61(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD61_MASK, LCD_WF8B_BPDLCD61(value)))
#define LCD_BWR_WF8B_BPDLCD61(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD61_SHIFT), LCD_WF8B_BPDLCD61_SHIFT, LCD_WF8B_BPDLCD61_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD9[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD9 field. */
#define LCD_RD_WF8B_BPDLCD9(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD9_MASK) >> LCD_WF8B_BPDLCD9_SHIFT)
#define LCD_BRD_WF8B_BPDLCD9(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD9_SHIFT, LCD_WF8B_BPDLCD9_WIDTH))

/*! @brief Set the BPDLCD9 field to a new value. */
#define LCD_WR_WF8B_BPDLCD9(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD9_MASK, LCD_WF8B_BPDLCD9(value)))
#define LCD_BWR_WF8B_BPDLCD9(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD9_SHIFT), LCD_WF8B_BPDLCD9_SHIFT, LCD_WF8B_BPDLCD9_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD17[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD17 field. */
#define LCD_RD_WF8B_BPDLCD17(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD17_MASK) >> LCD_WF8B_BPDLCD17_SHIFT)
#define LCD_BRD_WF8B_BPDLCD17(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD17_SHIFT, LCD_WF8B_BPDLCD17_WIDTH))

