RT-Thread/rt-thread/bsp/freescale/platform/devices/MKL34Z4/include/MKL34Z4_extension.h
/*! @brief Set the BPDLCD3 field to a new value. */
#define LCD_WR_WF8B_BPDLCD3(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD3_MASK, LCD_WF8B_BPDLCD3(value)))
#define LCD_BWR_WF8B_BPDLCD3(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD3_SHIFT), LCD_WF8B_BPDLCD3_SHIFT, LCD_WF8B_BPDLCD3_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD11[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD11 field. */
#define LCD_RD_WF8B_BPDLCD11(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD11_MASK) >> LCD_WF8B_BPDLCD11_SHIFT)
#define LCD_BRD_WF8B_BPDLCD11(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD11_SHIFT, LCD_WF8B_BPDLCD11_WIDTH))

/*! @brief Set the BPDLCD11 field to a new value. */
#define LCD_WR_WF8B_BPDLCD11(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD11_MASK, LCD_WF8B_BPDLCD11(value)))
#define LCD_BWR_WF8B_BPDLCD11(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD11_SHIFT), LCD_WF8B_BPDLCD11_SHIFT, LCD_WF8B_BPDLCD11_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD12[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD12 field. */
#define LCD_RD_WF8B_BPELCD12(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD12_MASK) >> LCD_WF8B_BPELCD12_SHIFT)
#define LCD_BRD_WF8B_BPELCD12(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD12_SHIFT, LCD_WF8B_BPELCD12_WIDTH))

/*! @brief Set the BPELCD12 field to a new value. */
#define LCD_WR_WF8B_BPELCD12(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD12_MASK, LCD_WF8B_BPELCD12(value)))
#define LCD_BWR_WF8B_BPELCD12(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD12_SHIFT), LCD_WF8B_BPELCD12_SHIFT, LCD_WF8B_BPELCD12_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD39[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD39 field. */
#define LCD_RD_WF8B_BPELCD39(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD39_MASK) >> LCD_WF8B_BPELCD39_SHIFT)
#define LCD_BRD_WF8B_BPELCD39(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD39_SHIFT, LCD_WF8B_BPELCD39_WIDTH))

/*! @brief Set the BPELCD39 field to a new value. */
#define LCD_WR_WF8B_BPELCD39(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD39_MASK, LCD_WF8B_BPELCD39(value)))
#define LCD_BWR_WF8B_BPELCD39(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD39_SHIFT), LCD_WF8B_BPELCD39_SHIFT, LCD_WF8B_BPELCD39_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD3[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD3 field. */
#define LCD_RD_WF8B_BPELCD3(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD3_MASK) >> LCD_WF8B_BPELCD3_SHIFT)
#define LCD_BRD_WF8B_BPELCD3(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD3_SHIFT, LCD_WF8B_BPELCD3_WIDTH))

/*! @brief Set the BPELCD3 field to a new value. */
#define LCD_WR_WF8B_BPELCD3(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD3_MASK, LCD_WF8B_BPELCD3(value)))
#define LCD_BWR_WF8B_BPELCD3(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD3_SHIFT), LCD_WF8B_BPELCD3_SHIFT, LCD_WF8B_BPELCD3_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD38[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD38 field. */
#define LCD_RD_WF8B_BPELCD38(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD38_MASK) >> LCD_WF8B_BPELCD38_SHIFT)
#define LCD_BRD_WF8B_BPELCD38(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD38_SHIFT, LCD_WF8B_BPELCD38_WIDTH))

/*! @brief Set the BPELCD38 field to a new value. */
#define LCD_WR_WF8B_BPELCD38(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD38_MASK, LCD_WF8B_BPELCD38(value)))
#define LCD_BWR_WF8B_BPELCD38(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD38_SHIFT), LCD_WF8B_BPELCD38_SHIFT, LCD_WF8B_BPELCD38_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD40[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD40 field. */
#define LCD_RD_WF8B_BPELCD40(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD40_MASK) >> LCD_WF8B_BPELCD40_SHIFT)
#define LCD_BRD_WF8B_BPELCD40(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD40_SHIFT, LCD_WF8B_BPELCD40_WIDTH))

/*! @brief Set the BPELCD40 field to a new value. */
#define LCD_WR_WF8B_BPELCD40(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD40_MASK, LCD_WF8B_BPELCD40(value)))
#define LCD_BWR_WF8B_BPELCD40(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD40_SHIFT), LCD_WF8B_BPELCD40_SHIFT, LCD_WF8B_BPELCD40_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD37[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD37 field. */
#define LCD_RD_WF8B_BPELCD37(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD37_MASK) >> LCD_WF8B_BPELCD37_SHIFT)
#define LCD_BRD_WF8B_BPELCD37(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD37_SHIFT, LCD_WF8B_BPELCD37_WIDTH))

/*! @brief Set the BPELCD37 field to a new value. */
#define LCD_WR_WF8B_BPELCD37(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPELCD37_MASK, LCD_WF8B_BPELCD37(value)))
#define LCD_BWR_WF8B_BPELCD37(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD37_SHIFT), LCD_WF8B_BPELCD37_SHIFT, LCD_WF8B_BPELCD37_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD41[4] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase E
 * - 0b1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD41 field. */
#define LCD_RD_WF8B_BPELCD41(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD41_MASK) >> LCD_WF8B_BPELCD41_SHIFT)
#define LCD_BRD_WF8B_BPELCD41(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD41_SHIFT, LCD_WF8B_BPELCD41_WIDTH))

